tutorials/helmholtz/acousticStreamingFoam/USDC/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

UInitial    (0 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $UInitial;

boundaryField
{
    ram
    {
        type            fixedValue;
        value           $internalField;
    }

    "(hot-top|sonotrode.*|fixed)"
    {
        type            noSlip;
    }

    "(graphite|mould|water-film)"
    {
        type            noSlip;
    }

    free-surface
    {
        type            zeroGradient;
    }

    symmetry
    {
        type		symmetry;
    }
}

// ************************************************************************ //
