tutorials/helmholtz/acousticStreamingFoam/USDC/0/ap
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ap;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(hot-top|graphite|mould|water-film|sonotrode.*|fixed)"
    {
        type	    calculated;
        value	    $internalField;
    }

    ram
    {
        type	    calculated;
        value	    $internalField;
    }

    free-surface
    {
        type	    calculated;
        value	    $internalField;
    }

    symmetry
    {
        type	    symmetry;
    }
}

// ************************************************************************* //
