tutorials/helmholtz/acousticStreamingFoam/USDC/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

epsilonInitial	0.001;

dimensions	[0 2 -3 0 0 0 0];

internalField	uniform $epsilonInitial;

boundaryField
{
    "(hot-top|graphite|mould|water-film|sonotrode.*|fixed)"
    {
        type	    epsilonWallFunction;
        value	    $internalField;
    }

    ram
    {
        type	    fixedValue;
        value       $internalField;
    }

    free-surface
    {
        type	    zeroGradient;
    }

    symmetry
    {
        type	    symmetry;
    }
}

// ************************************************************************* //
