tutorials/helmholtz/acousticStreamingFoam/USDC/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(hot-top|graphite|mould|water-film|sonotrode.*|fixed)"
    {
        type            fixedFluxPressure;
        gradient        $internalField;
        value           $internalField;
    }

    ram
    {
        type            fixedFluxPressure;
        gradient        $internalField;
        value           $internalField;
    }

    free-surface
    {
        type            fixedValue;
        value           $internalField;
    }

    symmetry
    {
        type		symmetry;
    }
}

// ************************************************************************* //
