tutorials/helmholtz/acousticStreamingFoam/USDC/Allrun.pre
#!/bin/bash

# Source tutorial run functions
source $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

# Mesh
runApplication blockMesh

# Decompose domain for parallelization
runApplication decomposePar

#------------------------------------------------------------------------------
