tutorials/helmholtz/acousticStreamingFoam/USDC/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu	[ 0  2 -1 0 0 0 0 ] 1e-05;

// Acoustic properties
omega	[ 0  0 -1 0 0 0 0 ] 125663.70614359173;
c	[ 0  1 -1 0 0 0 0 ] 4600.0;
rho	[ 1 -3  0 0 0 0 0 ] 2378.652;
A	[ 1 -3 -2 0 0 0 0 ] 1.342102e+03;
B	[ 1 -3 -2 0 0 0 0 ] 3.887629e+03;


// ************************************************************************* //
