tutorials/helmholtz/acousticStreamingFoam/USDC/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    ( 0.0000   0.0000 -300.0) //  0
    (11.9886   0.5234 -300.0) //  1
    (11.9886  -0.5234 -300.0) //  2
    (77.4262   3.3805 -300.0) //  3
    (77.4262  -3.3805 -300.0) //  4
    
    ( 0.0000   0.0000  -57.0) //  5
    (11.9886   0.5234  -57.0) //  6
    (11.9886  -0.5234  -57.0) //  7
    (77.4262   3.3805  -57.0) //  8
    (77.4262  -3.3805  -57.0) //  9
    
    ( 0.0000   0.0000  -40.0) // 10
    (11.9886   0.5234  -40.0) // 11
    (11.9886  -0.5234  -40.0) // 12
    (77.4262   3.3805  -40.0) // 13
    (77.4262  -3.3805  -40.0) // 14
    
    ( 0.0000   0.0000    0.0) // 15
    (11.9886   0.5234    0.0) // 16
    (11.9886  -0.5234    0.0) // 17
    (77.4262   3.3805    0.0) // 18
    (77.4262  -3.3805    0.0) // 19
    
    ( 0.0000   0.0000   20.0) // 20
    (11.9886   0.5234   20.0) // 21
    (11.9886  -0.5234   20.0) // 22
    (77.4262   3.3805   20.0) // 23
    (77.4262  -3.3805   20.0) // 24
    
    ( 0.0000   0.0000  170.0) // 25
    (11.9886   0.5234  170.0) // 26
    (11.9886  -0.5234  170.0) // 27
    (77.4262   3.3805  170.0) // 28
    (77.4262  -3.3805  170.0) // 29
);

blocks
(
    hex ( 0  2  1  0  5  7  6  5) domain (15 1 243) simpleGrading (1 1 1)   //  0
    hex ( 2  4  3  1  7  9  8  6) domain (62 1 243) simpleGrading (0.7 1 1) //  1
    hex ( 5  7  6  5 10 12 11 10) domain (15 1  17) simpleGrading (1 1 1)   //  2
    hex ( 7  9  8  6 12 14 13 11) domain (62 1  17) simpleGrading (0.7 1 1) //  3
    hex (10 12 11 10 15 17 16 15) domain (15 1  40) simpleGrading (1 1 1)   //  4
    hex (12 14 13 11 17 19 18 16) domain (62 1  40) simpleGrading (0.7 1 1) //  5
    hex (15 17 16 15 20 22 21 20) domain (15 1  20) simpleGrading (1 1 1)   //  6
    hex (17 19 18 16 22 24 23 21) domain (62 1  20) simpleGrading (0.7 1 1) //  7
    hex (22 24 23 21 27 29 28 26) domain (62 1 150) simpleGrading (0.7 1 1) //  8
);

edges
(
    arc  1  2 (15.0000  0.0000 -300.0)
    arc  3  4 (77.5000  0.0000 -300.0)
    arc  6  7 (15.0000  0.0000  -57.0)
    arc  8  9 (77.5000  0.0000  -57.0)
    arc 11 12 (15.0000  0.0000  -40.0)
    arc 13 14 (77.5000  0.0000  -40.0)
    arc 16 17 (15.0000  0.0000    0.0)
    arc 18 19 (77.5000  0.0000    0.0)
    arc 21 22 (15.0000  0.0000   20.0)
    arc 23 24 (77.5000  0.0000   20.0)
    arc 26 27 (15.0000  0.0000  170.0)
    arc 28 29 (77.5000  0.0000  170.0)
);

boundary
(
    water-film
    {
        type wall;
        faces
        (
            ( 3  4  9  8)
        );
    }

    mould
    {
        type wall;
        faces
        (
            ( 8  9 14 13)
        );
    }

    graphite
    {
        type wall;
        faces
        (
            (13 14 19 18)
        );
    }

    hot-top
    {
        type wall;
        faces
        (
            (18 19 24 23)
        );
    }

    hot-top
    {
        type wall;
        faces
        (
            (23 24 29 28)
        );
    }

    ram
    {
        type patch;
        faces
        (
            ( 0  2  1  0)
            ( 2  4  3  1)
        );
    }

    sonotrode
    {
        type wall;
        faces
        (
            (20 22 21 20)
        );
    }

    sonotrode-wall
    {
        type wall;
        faces
        (
            (21 22 27 26)
        );
    }

    free-surface
    {
        type patch;
        faces
        (
            (27 29 28 26)
        );
    }

    axis
    {
        type empty;
        faces
        (
            ( 5  0  0  5)
            (10  5  5 10)
            (15 10 10 15)
            (20 15 15 20)
        );
    }

    symmetric
    {
        type symmetry;
        faces
        (
            ( 0  1  6  5)
            ( 7  2  0  5)
            ( 1  3  8  6)
            ( 9  4  2  7)
            ( 5  6 11 10)
            (12  7  5 10)
            ( 6  8 13 11)
            (14  9  7 12)
            (10 11 16 15)
            (17 12 10 15)
            (11 13 18 16)
            (19 14 12 17)
            (15 16 21 20)
            (22 17 15 20)
            (16 18 23 21)
            (24 19 17 22)
            (21 23 28 26)
            (29 24 22 27)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //

