tutorials/helmholtz/acousticStreamingFoam/USDC/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     acousticStreamingFoam;

// startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;
// stopAt          writeNow;

endTime         100.0;

deltaT          0.02;

// writeControl    timeStep;
writeControl    adjustableRunTime;

// writeInterval   8;
writeInterval   0.5;

purgeWrite      2;

writeFormat     binary;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

// adjustTimeStep  yes;
adjustTimeStep  no;

maxCo           0.5;
// maxDeltaT       1;

numericalFunctions
{
    #includeFunc residuals(funcName=residuals, p, U, omega, k)
}

surfaceFunctions
{
    #includeFunc cutPlaneSurface
    (
        funcName=yNormal,
        point=(1e3 0 0),
        normal=(0 1 0),
        fields=(p U omega k ap)
    )
}

functions {
    $numericalFunctions;
    $surfaceFunctions;
}

OptimisationSwitches
{
    fileHandler collated;
}

// ************************************************************************* //
