tutorials/helmholtz/acousticStreamingFoam/USDC/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;

    grad(p_Im)      leastSquares;
    grad(p_Re)      leastSquares;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linearUpwind grad(U);
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,omega) Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div((interpolate((grad(ap)|(rho*omega)))&Sf),(grad(ap)|(rho*omega))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    
    laplacian(p_Re) Gauss linear corrected;
    laplacian(p_Im) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method	    meshWave;
}

fluxRequired
{
    default         no;
    p_Im            ;
    p_Re            ;
}

// ************************************************************************* //
